Revit 2027 API
Concrete.ConcreteColor Property
 The property labeled "Color" from the "Concrete" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string ConcreteColor { get; }
Public Shared ReadOnly Property ConcreteColor As String
	Get
public:
static property String^ ConcreteColor {
	String^ get ();
}
static member ConcreteColor : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Concrete Class
Autodesk.Revit.DB.Visual Namespace